uhnp/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</name>
    <type>
      <types>EnumRef.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/СостоянияОтчетов/СостоянияОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОтчетов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЗаписанСОшибкой</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыНастроек/ТипыНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНастроек</name>
  <enumValues>
    <name>НастройкиОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеНастройкиОтчетов</name>
  </enumValues>
  <enumValues>
    <name>НастройкиФормы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиПользователяНастройкиОтчета</name>
  </enumValues>
  <enumValues>
    <name>НастройкиОбработки</name>
  </enumValues>
  <enumValues>
    <name>НастройкиПанели</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СохраненныеНастройки/СохраненныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СохраненныеНастройки</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ГруппыПользователей</owners>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ТипНастройки</name>
    <type>
      <types>EnumRef.ТипыНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>НастраиваемыйОбъект</name>
    <type>
      <types>String</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПриЗапуске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравоИзменения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Documents/НастраиваемыйОтчет/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТиповыеОтчетыУХ.СкопироватьЭлементы(Список.Отбор, Список.КомпоновщикНастроек.ПолучитьНастройки().Отбор);
	
	ОпределитьТекстЗапросаДляБпМсфо();

	ЗначениеВДанныеФормы(ОбщегоНазначенияСерверУХ.ВернутьТаблицуДоступныхПериодов(), ТаблицаДоступныхПериодов);
		
	ЗначениеВРеквизитФормы(ПолучитьДеревоОрганизаций(), "Организации");
	ЗначениеВРеквизитФормы(ПолучитьДеревоВидовОтчетов(), "ВидыОтчетов");
	
	Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Простые;
	
	ОтборПоСостоянию.Очистить();
	
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.Запланирован, "ИзменитьОтборЗапланирован", Ложь);
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.Выполняется, "ИзменитьОтборВыполняется", Ложь);
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.Подготовлен, "ИзменитьОтборПодготовлен", Ложь);
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.Утвержден, "ИзменитьОтборУтвержден", Ложь);
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.Возвращен, "ИзменитьОтборОтклонен", Ложь);
	ОтборПоСостоянию.Добавить(Перечисления.СостоянияОтчетов.ЗаписанСОшибкой, "ИзменитьОтборЗаписанСОшибкой", Ложь);
	
	ОтображатьСтандартныеОтборы = Ложь;
	
	ПрименитьПараметрыОтборов(Параметры);
	
	ЧислоДопАналитик=ПараметрыСеанса.ЧислоДопАналитик;
	
	Элементы.ФормаПротоколОбработки.Видимость = Ложь;
	
	Элементы.ИмпортДанных.Видимость = ОбщегоНазначенияПовтИспУХ.ПраваДоступаБюджетирование().НастраиваемыйОтчет_Изменение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ВидОтчета) Тогда
		СохраненнаяНастройкаПриИзменении(Неопределено);
	Иначе //Передели вид отчета из формы списка
		СохраненнаяНастройка =  ПредопределенноеЗначение("Справочник.СохраненныеНастройки.ПустаяСсылка");
	КонецЕсли;
		
	УстановитьПометкиКнопкамПоОтборуПоСостоянию();
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл 
		Если ЭлементОтбора.Использование Тогда
			//отбор установлен при вызове формы
			СинхронизироватьПростыеОтборы();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ЭтаФорма Тогда
		
	ИначеЕсли ИмяСобытия = "ВыбранаСохраненнаяНастройка" 
			И ТипЗнч(Параметр) = Тип("ФиксированнаяСтруктура")
			И Параметр.УИДФормы = УникальныйИдентификатор Тогда
		СохраненнаяНастройка = Параметр.СохраненнаяНастройка;
		Если Параметр.РежимСохраненияНастройки Тогда
			СохранитьНастройкиОтборов();
		Иначе
			ВосстановитьНастройкиОтборов();
			УстановитьПометкиКнопкамПоОтборуПоСостоянию();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененОбъектОтчетности_НастраиваемыйОтчет" Тогда
		
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "УтвердитьЭтап" ИЛИ ИмяСобытия = "ОтклонитьЭтап" ИЛИ ИмяСобытия = "ВернутьИсполнителю" ИЛИ ИмяСобытия = "ОбновитьМоиЗадачиИОповещения" Тогда
		
		// Оповещения согласования документа
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	#Область УХ_Согласование
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отборы

&НаКлиенте
Процедура ПрименитьПараметрыОтборов_Клиент(ТекПараметры) Экспорт
	
	ПрименитьПараметрыОтборов(ТекПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовОтчета(ВидОтчета)
	
	СписокОтбора=Новый СписокЗначений;
	
	Если ВидОтчета.ЭтоГруппа Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ВидыОтчетов.Ссылка
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	НЕ ВидыОтчетов.ЭтоГруппа
		|	И ВидыОтчетов.Ссылка В ИЕРАРХИИ(&Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка",ВидОтчета);
		
		СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	Иначе
		
		СписокОтбора.Добавить(ВидОтчета);
		
	КонецЕсли;
	
	Возврат СписокОтбора;
					 	
КонецФункции // ПолучитьСписокВидовОтчета() 

&НаСервере
Процедура ПрименитьПараметрыОтборов(ТекПараметры)
	
	Если ТекПараметры.Свойство("СохраненнаяНастройка") И ЗначениеЗаполнено(ТекПараметры.СохраненнаяНастройка) Тогда
		
		СохраненнаяНастройка = ТекПараметры.СохраненнаяНастройка;
		ВосстановитьНастройкиОтборов();
		
	Иначе	
		
		Если ТекПараметры.Свойство("ВидОтчета") И ЗначениеЗаполнено(ТекПараметры.ВидОтчета) Тогда
			
			ИспользоватьВидыОтчетов=Истина;
			
			СписокОтбора=ПолучитьСписокВидовОтчета(ТекПараметры.ВидОтчета);
			УстановитьОтборыПоВидуОтчета(СписокОтбора);
						
		КонецЕсли;
		
		Если ТекПараметры.Свойство("Организация") И ЗначениеЗаполнено(ТекПараметры.Организация) Тогда
			
			ИспользоватьОрганизации=Истина;
			
			МассивОтбора=Новый СписокЗначений;
			МассивОтбора.Добавить(ТекПараметры.Организация);
			УстановитьОтборыПоОрганизации(МассивОтбора);
							
		КонецЕсли;
		
		Если ТекПараметры.Свойство("Проект") И ЗначениеЗаполнено(ТекПараметры.Проект) Тогда
			
			ИспользоватьПроекты=Истина;
			
			МассивОтбора=Новый СписокЗначений;
			МассивОтбора.Добавить(ТекПараметры.Проект);
			УстановитьОтборыПоПроекту(МассивОтбора);
							
		КонецЕсли;
		
		Если ТекПараметры.Свойство("ПериодОтчета") И ЗначениеЗаполнено(ТекПараметры.ПериодОтчета) Тогда
			
			ИспользоватьПериод=Истина;
			
			ОтборПоПериоду.Очистить();
			ОтборПоПериоду.Добавить(ТекПараметры.ПериодОтчета);
			УстановитьОтборыПоПериоду();
			
		КонецЕсли;
		
		Если ТекПараметры.Свойство("Сценарий") И ЗначениеЗаполнено(ТекПараметры.Сценарий) Тогда
			
			ИспользоватьСценарий=Истина;
			
			ОтборПоСценарию.Очистить();
			ОтборПоСценарию.Добавить(ТекПараметры.Сценарий);
			УстановитьОтборыПоСценарию();
			
		КонецЕсли;
		
		Если ТекПараметры.Свойство("ШаблонОтчета") И ЗначениеЗаполнено(ТекПараметры.ШаблонОтчета) Тогда
			
			УстановитьОтборыПоШаблонуОтчета(ТекПараметры.ШаблонОтчета);
			
		КонецЕсли;
		
		Если ТекПараметры.Свойство("КИсполнению") И ТекПараметры.КИсполнению Тогда
			
			Исполнитель = Истина;
			МоиОтчеты   = Истина;
			УстановитьОтборыМоиОтчеты();
			
		КонецЕсли;
		
		Если ТекПараметры.Свойство("КСогласованию") И ТекПараметры.КСогласованию Тогда
			
			Согласующий = Истина;
			МоиОтчеты   = Истина;
			УстановитьОтборыМоиОтчеты();
			
		КонецЕсли;
		
		
	КонецЕсли;
		
	СинхронизироватьПростыеОтборы();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТекстЗапросаДляБпМсфо()
	
	Список.ТекстЗапроса = РасширениеБизнесЛогикиУХ.ПолучитьТекстЗапросаСпискаНастраиваемогоОтчета();
	
	Если ОбщегоНазначенияПовтИспУХ.ИспользуетсяМногопериоднаяОтчетность() Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", Пользователи.ТекущийПользователь());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ЗаполнениеДокументов

&НаКлиенте
Процедура ПротоколОбработки(Команда)
	
	// Отобразим прокол
	Если ЗначениеЗаполнено(АдресТаблицыСобытий) Тогда
		ОткрытьФорму("Обработка.ОтображениеПротоколируемыхСобытий.Форма.Форма",Новый Структура("АдресТаблицыСобытий",АдресТаблицыСобытий));
		Элементы.ФормаПротоколОбработки.Видимость = Истина;
	Иначе
		Элементы.ФормаПротоколОбработки.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПоУмолчанию(Команда)
	
	ЗаполнениеПоУмолчаниюНаСервере();
	ПротоколОбработки(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПоУмолчаниюНаСервере()
	
	ТаблицаСобытий = КэшируемыеПроцедурыУХ.ИнициализироватьТаблицуПротокола().Скопировать();
	АдресТаблицыСобытий = "";
	
	ОбработкаРасчета = РасширениеБизнесЛогикиУХ.ПолучитьОбработкуЗаполненияДанных();
		
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		
		НастраиваемыйОтчет = Строка.ПолучитьОбъект();
		РасширениеПроцессыИСогласованиеУХ.ЗаполнитьСостоянияСогласования(НастраиваемыйОтчет);
		
		Если НастраиваемыйОтчет.ПометкаУдаления
			ИЛИ НастраиваемыйОтчет.Состояние = Перечисления.СостоянияОтчетов.Утвержден
			ИЛИ НастраиваемыйОтчет.НеВноситьИзменения Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработкаРасчета.ЗаполнитьДанныеПоПериодам(НастраиваемыйОтчет, , , Истина);
			
		// Фиксируем события протокола
		Если ЗначениеЗаполнено(ОбработкаРасчета.АдресТаблицыСобытий) Тогда
			Для Каждого СтрокаСобытие Из ПолучитьИзВременногоХранилища(ОбработкаРасчета.АдресТаблицыСобытий) Цикл
				НовоеСобытие = ТаблицаСобытий.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеСобытие, СтрокаСобытие);
			КонецЦикла;
		КонецЕсли;
			
	КонецЦикла;
	
	Если ТаблицаСобытий.Количество() > 0 Тогда
		АдресТаблицыСобытий = ПоместитьВоВременноеХранилище(ТаблицаСобытий, УникальныйИдентификатор);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область РаботаССохраненнымиНастройкамиБланков

&НаСервере
Функция ПолучитьДеревоОрганизаций() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Значение,
	               |	Организации.Наименование КАК Наименование,
	               |	0 КАК Использовать
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Значение ИЕРАРХИЯ
	               |АВТОУПОРЯДОЧИВАНИЕ";	
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецФункции

&НаСервере
Функция ПолучитьДеревоВидовОтчетов() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВидыОтчетов.Ссылка КАК Значение,
	               |	ВидыОтчетов.Наименование КАК Наименование,
	               |	0 КАК Использовать
	               |ИЗ
	               |	Справочник.ВидыОтчетов КАК ВидыОтчетов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Значение ИЕРАРХИЯ
	               |АВТОУПОРЯДОЧИВАНИЕ";	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецФункции

&НаКлиенте
Процедура ИзменитьФлажкиПодчиненныхЭлементов(КоллекцияЭлементов, ЗначениеФлажка)
	
	Для Каждого Элемент Из КоллекцияЭлементов Цикл
		
		Элемент.Использовать = ЗначениеФлажка;
		ИзменитьФлажкиПодчиненныхЭлементов(Элемент.ПолучитьЭлементы(), ЗначениеФлажка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажокРодителя(Родитель)
	
	ВнПодчиненныеЭлементы = Родитель.ПолучитьЭлементы();
	
	ТекущееСостояние = -1;
	
	Для Каждого Элемент Из ВнПодчиненныеЭлементы Цикл
		
		Если ТекущееСостояние = -1 Тогда
			ТекущееСостояние = Элемент.Использовать;
		ИначеЕсли ТекущееСостояние <> Элемент.Использовать Тогда
			ТекущееСостояние = 2;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Если Родитель.Использовать <> 1 Тогда
		Родитель.Использовать = ТекущееСостояние;
	КонецЕсли;
		
	РодительРодителя = Родитель.ПолучитьРодителя();
	
	Если РодительРодителя <> Неопределено Тогда
		
		ИзменитьФлажокРодителя(РодительРодителя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМассивВыбранныхЭлементов(СтрокиОтбора, МассивОтбора)
	
	Для Каждого Строка Из СтрокиОтбора Цикл
		
		Если Строка.Использовать <> 0 Тогда
			
			ВнПодчиненныеЭлементы = Строка.ПолучитьЭлементы();
			Если ВнПодчиненныеЭлементы.Количество() = 0 Тогда
				МассивОтбора.Добавить(Строка.Значение);
			Иначе
				ПолучитьМассивВыбранныхЭлементов(ВнПодчиненныеЭлементы, МассивОтбора);
				
				Если Строка.Использовать = 1 Тогда
					МассивОтбора.Добавить(Строка.Значение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиКнопкамПоОтборуПоСостоянию()
	
	Для Каждого Элемент Из ОтборПоСостоянию Цикл
		Элементы[Элемент.Представление].Пометка = Элемент.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьФлажкиУДереваЗначений(ТекущиеЭлементы)
	
	Для Каждого Элемент Из ТекущиеЭлементы Цикл
		
		Элемент.Использовать = Ложь;
		ОчиститьФлажкиУДереваЗначений(Элемент.ПолучитьЭлементы());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиОтборуПоСостояниюПоКнопкам()
	
	Для Каждого Элемент Из ОтборПоСостоянию Цикл
		Элемент.Пометка = Элементы[Элемент.Представление].Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьПростыеОтборы(ИспользоватьОтносительныйОтбор = Ложь)
	
	ПолеСостояние    = Новый ПолеКомпоновкиДанных("Состояние");
	ПолеСценарий     = Новый ПолеКомпоновкиДанных("Сценарий");
	ПолеПериодОтчета = Новый ПолеКомпоновкиДанных("ПериодОтчета");
	ПолеОрганизация  = Новый ПолеКомпоновкиДанных("Организация");
	ПолеВидОтчета    = Новый ПолеКомпоновкиДанных("ВидОтчета");
	ПолеИсполнитель  = Новый ПолеКомпоновкиДанных("ИсполняетсяТекущимПользователем");
	ПолеСогласующий  = Новый ПолеКомпоновкиДанных("СогласуетсяТекущимПользователем");
	
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			МоиОтчеты = Элемент.Использование;
			
			Для Каждого ВнЭлемент Из Элемент.Элементы Цикл
				
				Если ВнЭлемент.ЛевоеЗначение = ПолеИсполнитель Тогда
					Исполнитель = ВнЭлемент.Использование;
				ИначеЕсли ВнЭлемент.ЛевоеЗначение = ПолеСогласующий Тогда
					Согласующий = ВнЭлемент.Использование;
				КонецЕсли;
				
			КонецЦикла;
 
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеСценарий Тогда
			
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ОтборПоСценарию.ЗагрузитьЗначения(Элемент.ПравоеЗначение.ВыгрузитьЗначения());
			Иначе
				ОтборПоСценарию.Очистить();
				ОтборПоСценарию.Добавить(Элемент.ПравоеЗначение);
			КонецЕсли;
			
			ИспользоватьСценарий = Элемент.Использование;
			
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеПериодОтчета Тогда
			
			
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ОтборПоПериоду.ЗагрузитьЗначения(Элемент.ПравоеЗначение.ВыгрузитьЗначения());
			Иначе
				ОтборПоПериоду.Очистить();
				ОтборПоПериоду.Добавить(Элемент.ПравоеЗначение);
			КонецЕсли;
			
			
			ИспользоватьПериод = Элемент.Использование;
			
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеВидОтчета Тогда
			
			ИспользоватьВидыОтчетов = Элемент.Использование;
			
			ОчиститьФлажкиУДереваЗначений(ВидыОтчетов.ПолучитьЭлементы());
			Если ТипЗнч(Элемент.ПравоеЗначение) <> Тип("СписокЗначений") Тогда
				СписокЗначенийОтбора = Новый СписокЗначений;
				СписокЗначенийОтбора.Добавить(Элемент.ПравоеЗначение);
				ОбновитьФлажкиДеревьев("ВидыОтчетов", СписокЗначенийОтбора);
			Иначе
				ОбновитьФлажкиДеревьев("ВидыОтчетов", Элемент.ПравоеЗначение);
			КонецЕсли;
			
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеОрганизация Тогда
			
			ОчиститьФлажкиУДереваЗначений(Организации.ПолучитьЭлементы());
			ИспользоватьОрганизации = Элемент.Использование;
			
			Если ТипЗнч(Элемент.ПравоеЗначение) <> Тип("СписокЗначений") Тогда
				СписокЗначенийОтбора = Новый СписокЗначений;
				СписокЗначенийОтбора.Добавить(Элемент.ПравоеЗначение);
				ОбновитьФлажкиДеревьев("Организации", СписокЗначенийОтбора);
			Иначе
				ОбновитьФлажкиДеревьев("Организации", Элемент.ПравоеЗначение);
			КонецЕсли;
			
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеСостояние Тогда
			
			ИспользоватьСостояние = Элемент.Использование;
			
			ОтборПоСостоянию.ЗаполнитьПометки(Ложь);
			Если ТипЗнч(Элемент.ПравоеЗначение) <> Тип("СписокЗначений") Тогда
				ТекЗапись = ОтборПоСостоянию.НайтиПоЗначению(Элемент.ПравоеЗначение);
				Если ТекЗапись <> Неопределено Тогда
					ТекЗапись.Пометка = Истина;
				КонецЕсли;
			Иначе
				Для Каждого ЭлементОтбора Из Элемент.ПравоеЗначение Цикл
					ТекЗапись = ОтборПоСостоянию.НайтиПоЗначению(ЭлементОтбора.Значение);
					ТекЗапись.Пометка = Истина;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФлажкиДеревьев(ИмяРеквизитаДерева, МассивВыбранныхЭлементов)
	
	ТекущееДерево = РеквизитФормыВЗначение(ИмяРеквизитаДерева);
	
	Для Каждого Элемент Из МассивВыбранныхЭлементов Цикл
		
		НайденнаяСтрока = ТекущееДерево.Строки.Найти(Элемент.Значение, "Значение",Истина);
		
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Использовать = 1;
			Если НайденнаяСтрока.Родитель <> Неопределено Тогда
				ОбновитьПризнакИспользованияУРодителя(НайденнаяСтрока.Родитель);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТекущееДерево, ИмяРеквизитаДерева);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакИспользованияУРодителя(Родитель)
	
	ТекущееИспользование = -1;
	
	Для Каждого Строка Из Родитель.Строки Цикл
		
		Если ТекущееИспользование = -1 Тогда
			ТекущееИспользование = Строка.Использовать;
		ИначеЕсли ТекущееИспользование <> Строка.Использовать Тогда
			ТекущееИспользование = 2;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Родитель.Использовать=ТекущееИспользование;
	
	Если Родитель.Родитель <> Неопределено Тогда
		ОбновитьПризнакИспользованияУРодителя(Родитель.Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОтчетовИспользоватьПриИзменении(Элемент)
	
	ТекущаяСтрока = ВидыОтчетов.НайтиПоИдентификатору(Элементы.ВидыОтчетов.ТекущаяСтрока);
	
	Если ТекущаяСтрока.Использовать = 2 Тогда
		ТекущаяСтрока.Использовать = 0;
	КонецЕсли;
	
	ИзменитьФлажкиПодчиненныхЭлементов(ТекущаяСтрока.ПолучитьЭлементы(), ТекущаяСтрока.Использовать);
	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда
		ИзменитьФлажокРодителя(Родитель);
	КонецЕсли;
	
	МассивОтбора = Новый СписокЗначений;
	ПолучитьМассивВыбранныхЭлементов(ВидыОтчетов.ПолучитьЭлементы(), МассивОтбора);
	
	Если МассивОтбора.Количество() = 0 Тогда
		ИспользоватьВидыОтчетов = Ложь;
	Иначе
		ИспользоватьВидыОтчетов = Истина;
	КонецЕсли;
	
	УстановитьОтборыПоВидуОтчета(МассивОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииИспользоватьПриИзменении(Элемент)
	
	ТекущаяСтрока = Организации.НайтиПоИдентификатору(Элементы.Организации.ТекущаяСтрока);
		
	Если ТекущаяСтрока.ПолучитьЭлементы().Количество() = 0 И ТекущаяСтрока.Использовать = 2 Тогда
		ТекущаяСтрока.Использовать = 0;
	КонецЕсли;
		
	Если ТекущаяСтрока.Использовать <> 2 Тогда
		ИзменитьФлажкиПодчиненныхЭлементов(ТекущаяСтрока.ПолучитьЭлементы(), ТекущаяСтрока.Использовать);
		Родитель = ТекущаяСтрока.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			ИзменитьФлажокРодителя(Родитель);
		КонецЕсли;
	КонецЕсли;
		
	МассивОтбора = Новый СписокЗначений;
	ПолучитьМассивВыбранныхЭлементов(Организации.ПолучитьЭлементы(), МассивОтбора);
	
	Если МассивОтбора.Количество() = 0 Тогда
		ИспользоватьОрганизации = Ложь;
	Иначе
		ИспользоватьОрганизации = Истина;
	КонецЕсли;
	
	УстановитьОтборыПоОрганизации(МассивОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура МоиОтчетыПриИзменении(Элемент)
	
	Если МоиОтчеты Тогда
		Исполнитель = Истина;
		Согласующий = Истина;
	КонецЕсли;
	
	УстановитьОтборыМоиОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсполнительПриИзменении(Элемент)
	
	МоиОтчеты = Исполнитель ИЛИ Согласующий;
	УстановитьОтборыМоиОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСогласующийПриИзменении(Элемент)
	
	МоиОтчеты = Исполнитель Или  Согласующий ;
	УстановитьОтборыМоиОтчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСценарийПриИзменении(Элемент)
	
	УстановитьОтборыПоСценарию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСценариюПриИзменении(Элемент)
	
	ИспользоватьСценарий = Истина;
	УстановитьОтборыПоСценарию();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.Простые Тогда
		
		СинхронизироватьПростыеОтборы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВидыОтчетовПриИзменении(Элемент)
	
	МассивОтбора = Новый СписокЗначений;
	ПолучитьМассивВыбранныхЭлементов(ВидыОтчетов.ПолучитьЭлементы(), МассивОтбора);
	УстановитьОтборыПоВидуОтчета(МассивОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОрганизацииПриИзменении(Элемент)
	
	МассивОтбора = Новый СписокЗначений;
	ПолучитьМассивВыбранныхЭлементов(Организации.ПолучитьЭлементы(), МассивОтбора);
	УстановитьОтборыПоОрганизации(МассивОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСтандартныеОтборыПриИзменении(Элемент)
	
	Если ОтображатьСтандартныеОтборы Тогда
		Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Стандартные;
	Иначе
		Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Простые;
		СинхронизироватьПростыеОтборы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборВыполняется(Команда)
	
	Элементы.ИзменитьОтборВыполняется.Пометка = НЕ Элементы.ИзменитьОтборВыполняется.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборЗаписанСОшибкой(Команда)
	
	Элементы.ИзменитьОтборЗаписанСОшибкой.Пометка = НЕ Элементы.ИзменитьОтборЗаписанСОшибкой.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборЗапланирован(Команда)
	
	Элементы.ИзменитьОтборЗапланирован.Пометка = НЕ Элементы.ИзменитьОтборЗапланирован.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборОтклонен(Команда)
	
	Элементы.ИзменитьОтборОтклонен.Пометка = НЕ Элементы.ИзменитьОтборОтклонен.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборПодготовлен(Команда)
	
	Элементы.ИзменитьОтборПодготовлен.Пометка = НЕ Элементы.ИзменитьОтборПодготовлен.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтборУтвержден(Команда)
	
	Элементы.ИзменитьОтборУтвержден.Пометка = НЕ Элементы.ИзменитьОтборУтвержден.Пометка;
	ИспользоватьСостояние = Истина;
	УстановитьПометкиОтборуПоСостояниюПоКнопкам();
	УстановитьОтборыПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеИзменениеСостояния(Команда)
	
	Отказ = Ложь;
	ПроверитьСуперпользователяДанных(Элементы.Список.ВыделенныеСтроки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("МассивОтчетов", Элементы.Список.ВыделенныеСтроки);
	ПараметрыФормы.Вставить("ИдентификаторФормыВладельца", ЭтотОбъект.УникальныйИдентификатор);
	ОткрытьФорму("Обработка.ГрупповоеИзменениеРеквизитовОтчетов.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСуперпользователяДанных(Знач МассивДанных, Отказ)

	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПроцессыИСогласование") Тогда
		
		МассивОшибок = Новый Массив;
		МодульМодульСогласованияДокументовУХ = ОбщегоНазначения.ОбщийМодуль("МодульСогласованияДокументовУХ");
		
		Для Каждого ЭлементДанных Из МассивДанных Цикл
			Если НЕ МодульМодульСогласованияДокументовУХ.ЕстьСуперПользователь(ЭлементДанных.Организация) И МассивОшибок.Найти(ЭлементДанных.Организация) = Неопределено Тогда
				МассивОшибок.Добавить(ЭлементДанных.Организация);
			КонецЕсли;
		КонецЦикла;
		
		ТекстОрганизаций = "";
		Для Каждого ОрганизацияБезПраваДоступа Из МассивОшибок Цикл
			ТекстОрганизаций = ТекстОрганизаций + ", """ + Строка(ОрганизацияБезПраваДоступа) + """";
		КонецЦикла;
		
		Если МассивОшибок.Количество() = 1 Тогда
			Отказ = Истина;
			ТекстОрганизаций = Сред(ТекстОрганизаций, 3);
			ТекстОшибки = СтрШаблон(Нстр("ru = 'Для организации %1 текущий пользователь не обладает ролью ""Суперпользователь""'"), ТекстОрганизаций);
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки,,, СтатусСообщения.Важное);
		ИначеЕсли МассивОшибок.Количество() > 1 Тогда
			Отказ = Истина;
			ТекстОрганизаций = Сред(ТекстОрганизаций, 3);
			ТекстОшибки = СтрШаблон(Нстр("ru = 'Для организаций: %1 текущий пользователь не обладает ролью ""Суперпользователь""'"), ТекстОрганизаций);
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстОшибки,,, СтатусСообщения.Важное);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	ТиповыеОтчеты_УправляемыйРежимУХ.СохранитьТекущуюНастройку_УР("ДокументСписок.НастраиваемыйОтчет", УникальныйИдентификатор, СохраненнаяНастройка, "Перечисление.ТипыНастроек.НастройкиФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуКак(Команда)
	
	ТиповыеОтчеты_УправляемыйРежимУХ.СохранитьТекущуюНастройкуКак_УР("ДокументСписок.НастраиваемыйОтчет", УникальныйИдентификатор, СохраненнаяНастройка, "Перечисление.ТипыНастроек.НастройкиФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненнаяНастройкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора = ПолучитьИзВременногоХранилища(ТиповыеОтчетыУХ.ПолучитьСписокДоступныхВариантов("ДокументСписок.НастраиваемыйОтчет"));

КонецПроцедуры

&НаКлиенте
Процедура СохраненнаяНастройкаПриИзменении(Элемент)
	
	Если НЕ СохраненнаяНастройка.Пустая() Тогда		
		ВосстановитьНастройкиОтборов();
	Иначе		
		ОчиститьНастройкиОтборов();		
	КонецЕсли;
	
	УстановитьПометкиКнопкамПоОтборуПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненнаяНастройкаОчистка(Элемент, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиОтборов()
		
	НастройкиСКД 						= Список.КомпоновщикНастроек.Настройки;
	ПользовательскиеНастройкиСКД 		= Список.КомпоновщикНастроек.ПользовательскиеНастройки;		
	ОтборПН 							= ПользовательскиеНастройкиСКД.Элементы.Найти(НастройкиСКД.Отбор.ИдентификаторПользовательскойНастройки);
	ОтображатьСтандартныеОтборы         = Ложь;
	
	
	ОчиститьВетвьОтборов(Список.Отбор.Элементы);//ОтборПН.Элементы
	
	Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Простые;	
	СинхронизироватьПростыеОтборы();

	Список.Группировка.Элементы.Очистить();
	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВетвьОтборов(ЭлементыОтбора)
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементОтбора.Использование = Ложь;
		Иначе
			ЭлементОтбора.Использование = Ложь;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Неопределено;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьВетвьОтборов(СтрокиДерева, ЭлементыОтбора)
	
	Для Каждого Элемент Из ЭлементыОтбора Цикл
		
		НоваяСтрока               = СтрокиДерева.Добавить();
		НоваяСтрока.Использование = Элемент.Использование;
		
		НоваяСтрока.ЭтоГруппа     = ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных");
		Если НоваяСтрока.ЭтоГруппа Тогда
			НоваяСтрока.ИмяПоля   = Элемент.Представление;
			ПодготовитьВетвьОтборов(НоваяСтрока.Строки, Элемент.Элементы);
		Иначе
			НоваяСтрока.ИмяПоля      = Строка(Элемент.ЛевоеЗначение);
			НоваяСтрока.ВидСравнения = Элемент.ВидСравнения;
			НоваяСтрока.Значение     = Элемент.ПравоеЗначение;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	СтруктураСохраненияОтборов = Новый Структура;
	СтруктураСохраненияОтборов.Вставить("ОтображатьСтандартныеОтборы", ОтображатьСтандартныеОтборы);
	СтруктураСохраненияОтборов.Вставить("ОтносительныйПериод"        , ОтносительныйРеквизитПериод);
	СтруктураСохраненияОтборов.Вставить("КодПериода"                 , ОтборПоПериодуОтносительный);
	ДеревоОтборов = Новый ДеревоЗначений;
	ДеревоОтборов.Колонки.Добавить("ИмяПоля");
	ДеревоОтборов.Колонки.Добавить("ВидСравнения");
	ДеревоОтборов.Колонки.Добавить("Значение");
	ДеревоОтборов.Колонки.Добавить("Использование");
	ДеревоОтборов.Колонки.Добавить("ЭтоГруппа");
	ПодготовитьВетвьОтборов(ДеревоОтборов.Строки, Список.Отбор.Элементы);
	
	ТаблицаГруппировок = Новый ТаблицаЗначений;
	ТаблицаГруппировок.Колонки.Добавить("ИмяПоля");
	ТаблицаГруппировок.Колонки.Добавить("Использование");
	ТаблицаГруппировок.Колонки.Добавить("ТипГруппировки");
	ТаблицаГруппировок.Колонки.Добавить("ТипДополнения");
	ТаблицаГруппировок.Колонки.Добавить("НачалоПериода");
	ТаблицаГруппировок.Колонки.Добавить("КонецПериода");
	
	Для Каждого ЭлементГруппировки Из Список.Группировка.Элементы Цикл
		
		НоваяСтрока = ТаблицаГруппировок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементГруппировки);
		НоваяСтрока.ИмяПоля = Строка(ЭлементГруппировки.Поле);
		
	КонецЦикла;
	
	СтруктураСохраненияОтборов.Вставить("ТаблицаГруппировок", ТаблицаГруппировок);
	
	СтруктураСохраненияОтборов.Вставить("ДеревоОтборов", ДеревоОтборов);
	СохраненнаяНастройкаОбъект = СохраненнаяНастройка.ПолучитьОбъект();
	СохраненнаяНастройкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СтруктураСохраненияОтборов);
	Попытка
		СохраненнаяНастройкаОбъект.Записать();
	Исключение
		ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Не удалось сохранить настройку'"));
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьВетвьОтборов(СтрокиОтчетов, ЭлементыОтбора)
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			НайденнаяСтрока = СтрокиОтчетов.Найти(Строка(ЭлементОтбора.Представление), "ИмяПоля");
			Если НайденнаяСтрока <> Неопределено Тогда
				ЭлементОтбора.Использование = НайденнаяСтрока.Использование;
				ВосстановитьВетвьОтборов(НайденнаяСтрока.Строки, ЭлементОтбора.Элементы);
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецЕсли;
		Иначе
			НайденнаяСтрока = СтрокиОтчетов.Найти(Строка(ЭлементОтбора.ЛевоеЗначение), "ИмяПоля");
			Если НайденнаяСтрока = Неопределено Тогда
				ЭлементОтбора.ИСпользование = Ложь;
			Иначе
				ЭлементОтбора.ВидСравнения   = НайденнаяСтрока.ВидСравнения;
				ЭлементОтбора.ПравоеЗначение = НайденнаяСтрока.Значение;
				ЭлементОтбора.Использование  = НайденнаяСтрока.Использование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОтборов()
	
	СтруктураНастройки = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура") 
		И СтруктураНастройки.Свойство("ОтображатьСтандартныеОтборы", ОтображатьСтандартныеОтборы) Тогда
		
		НастройкиСКД = Список.КомпоновщикНастроек.Настройки;
		ПользовательскиеНастройкиСКД = Список.КомпоновщикНастроек.ПользовательскиеНастройки;		
		ОтборПН = ПользовательскиеНастройкиСКД.Элементы.Найти(НастройкиСКД.Отбор.ИдентификаторПользовательскойНастройки);
		
		ВосстановитьВетвьОтборов(СтруктураНастройки.ДеревоОтборов.Строки, Список.Отбор.Элементы);//ОтборПН.Элементы
		СтруктураНастройки.Свойство("ОтносительныйПериод", ОтносительныйРеквизитПериод);
		СтруктураНастройки.Свойство("КодПериода"         , ОтборПоПериодуОтносительный);

		Если СтруктураНастройки.ОтображатьСтандартныеОтборы Тогда
			Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Стандартные;
		Иначе
			СинхронизироватьПростыеОтборы();
			Элементы.НастройкиОтбора.ТекущаяСтраница = Элементы.Простые;
		КонецЕсли;
		
		Список.Группировка.Элементы.Очистить();
		
		Если СтруктураНастройки.Свойство("ТаблицаГруппировок") Тогда
			
			Для Каждого ЭлементГруппировки Из СтруктураНастройки.ТаблицаГруппировок Цикл
				
				НоваяГруппировка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НоваяГруппировка, ЭлементГруппировки);
				НоваяГруппировка.Поле = Новый ПолеКомпоновкиДанных(ЭлементГруппировки.ИмяПоля);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияУХ.СообщитьОбОшибке(Нстр("ru = 'Не удалось восстановить настройки отборов'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоВидуОтчета(МассивОтбора)
	
	ТекПоле  = Новый ПолеКомпоновкиДанных("ВидОтчета");
	ТекОтбор = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ТекПоле);
	
	Если ТекОтбор = Неопределено Тогда
		
		ТекОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.ЛевоеЗначение = ТекПоле;
		
	КонецЕсли;
	
	ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	ТекОтбор.ПравоеЗначение = МассивОтбора;
	ТекОтбор.Использование  = ИспользоватьВидыОтчетов;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоШаблонуОтчета(ШаблонОтчета)
	
	ТекПоле  = Новый ПолеКомпоновкиДанных("ШаблонОтчета");
		
	ТекОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.ЛевоеЗначение = ТекПоле;
			
	ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	ТекОтбор.ПравоеЗначение = ШаблонОтчета;
	ТекОтбор.Использование  = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоОрганизации(МассивОтбора)
	
	ТекПоле  = Новый ПолеКомпоновкиДанных("Организация");
	ТекОтбор = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ТекПоле);
	
	Если ТекОтбор = Неопределено Тогда
		ТекОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.ЛевоеЗначение = ТекПоле;
	КонецЕсли;
	
	ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	ТекОтбор.ПравоеЗначение = МассивОтбора;
	ТекОтбор.Использование  = ИспользоватьОрганизации;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоПроекту(МассивОтбора)
	
	ТекПоле  = Новый ПолеКомпоновкиДанных("Проект");
	ТекОтбор = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ТекПоле);
	
	Если ТекОтбор = Неопределено Тогда
		ТекОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.ЛевоеЗначение = ТекПоле;
	КонецЕсли;
	
	ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	ТекОтбор.ПравоеЗначение = МассивОтбора;
	ТекОтбор.Использование  = ИспользоватьПроекты;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыМоиОтчеты()
	
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ГруппаЭлемент = Элемент;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ГруппаЭлемент.Использование = МоиОтчеты;
	ЭлементыГруппы = ГруппаЭлемент.Элементы;
	
	ПолеИсполнитель = Новый ПолеКомпоновкиДанных("ИсполняетсяТекущимПользователем");
	ПолеСогласующий = Новый ПолеКомпоновкиДанных("СогласуетсяТекущимПользователем");
	
	Для Каждого Элемент Из ЭлементыГруппы Цикл
		Если Элемент.ЛевоеЗначение = ПолеИсполнитель Тогда
			Элемент.Использование = Исполнитель;
		ИначеЕсли Элемент.ЛевоеЗначение = ПолеСогласующий Тогда
			Элемент.Использование = Согласующий;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоСценарию()
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Сценарий");
	ТекЭлемент = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ПолеКомпоновки);
	
	Если ТекЭлемент = Неопределено Тогда
		ТекЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекЭлемент.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	
	ТекЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ТекЭлемент.ПравоеЗначение = ОтборПоСценарию;
	
	ТекЭлемент.Использование = ИспользоватьСценарий;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоПериоду()
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ПериодОтчета");
	ТекЭлемент = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ПолеКомпоновки);
	
	Если ТекЭлемент = Неопределено Тогда
		ТекЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекЭлемент.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	
	ТекЭлемент.ВидСравнения   = ?(ИспользоватьПодчиненныеПериоды, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, ВидСравненияКомпоновкиДанных.ВСписке);
	ТекЭлемент.ПравоеЗначение = ОтборПоПериоду;
	
	ТекЭлемент.Использование = ИспользоватьПериод;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыПоСостоянию()
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Состояние");
	ТекЭлемент     = ТиповыеОтчеты_УправляемыйРежимУХ.ВернутьЭлементОтбора(Список.Отбор, ПолеКомпоновки);
	Если ТекЭлемент = Неопределено Тогда
		ТекЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекЭлемент.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	
	ТекЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	СписокОтборов = Новый СписокЗначений;
	
	Для Каждого ЭлементОтбора Из ОтборПоСостоянию Цикл
		
		Если ЭлементОтбора.Пометка Тогда
			СписокОтборов.Добавить(ЭлементОтбора.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокОтборов.Количество() = 0 Тогда
		ИспользоватьСостояние = Ложь;
	Иначе
		ИспользоватьСостояние = Истина;
	КонецЕсли;

	
	ТекЭлемент.ПравоеЗначение = СписокОтборов;
	ТекЭлемент.Использование  = ИспользоватьСостояние;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
